---
kind: type
id: T:Autodesk.Revit.DB.ConnectorSetIterator
source: html/211f670f-72c3-6b6b-24dd-1a784f80a338.htm
---
# Autodesk.Revit.DB.ConnectorSetIterator

An iterator to a set.

## Syntax (C#)
```csharp
public abstract class ConnectorSetIterator : APIObject,
	IEnumerator
```